driver-tests/bpelse/benchmark/BenchmarkJbi/test/benchMarkInvoke/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://localhost/MultiDepBpel/benchMark" xmlns:ns0="http://localhost/MultiDepBpel/benchMark">
<SOAP-ENV:Header/>
<SOAP-ENV:Body>
  <benchMarkElement xmlns="http://localhost/MultiDepBpel/benchMark">
    <ns0:string xmlns:ns0="http://localhost/MultiDepBpel/benchMark">Response|Invoke2input|Fault Handler|2|10|9|20|ConditionElseif</ns0:string>
    <ns0:waitTime xmlns:ns0="http://localhost/MultiDepBpel/benchMark">P0Y0DT1S</ns0:waitTime>
    <ns0:payLoad xmlns:ns0="http://localhost/MultiDepBpel/benchMark">This is test payload</ns0:payLoad>
    <ns0:payLoad xmlns:ns0="http://localhost/MultiDepBpel/benchMark">This is test payload</ns0:payLoad>
    <ns0:payLoad xmlns:ns0="http://localhost/MultiDepBpel/benchMark">This is test payload</ns0:payLoad>
    <ns0:payLoad xmlns:ns0="http://localhost/MultiDepBpel/benchMark">This is test payload</ns0:payLoad>
  </benchMarkElement>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
