driver-tests/bpelse/benchmark/BenchmarkJbi/test/results/benchMarkInvoke/Actual_20130314121904_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <benchMarkElement xmlns="http://localhost/MultiDepBpel/benchMark" xmlns:msgns="http://localhost/MultiDepBpel/benchMark">
      <string>Response|Invoke2input|Fault Handler|2|10|9|20|ConditionElseif</string>
      <waitTime>P0Y0DT1S</waitTime>
      <payLoad>This is test payload</payLoad>
      <payLoad>This is test payload</payLoad>
      <payLoad>This is test payload</payLoad>
      <payLoad>This is test payload</payLoad>
    </benchMarkElement>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>